In [25]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import warnings

%matplotlib inline
warnings.filterwarnings("ignore")

In [26]:
AI_DATASET_PATH = "datasets/ai_generated_indonesia_combined.csv"
HUMAN_DATASET_PATH = "datasets/human_generated_indonesia_combined.csv"

In [27]:
ai_df = pd.read_csv(AI_DATASET_PATH)
human_df = pd.read_csv(HUMAN_DATASET_PATH)

In [28]:
ai_df = ai_df.drop(columns=["topic"])

In [29]:
ai_df.head()

                                                text  label
0  2 Samuel 4:14:23-14, 17. Dibuat dalam pasal 1 ...      1
1  Pada bidang fisika, "stoner" adalah istilah ya...      1
2  Pendidikan: Di bidang ekonomi, ada proses bela...      1
3  Ada sejumlah penyanyi dalam band ini selama be...      1
4  Menurut hukum Indonesia, terapi pencegahan pen...      1

In [30]:
ai_df = ai_df.rename(columns={"text": "message"})

In [31]:
ai_df.head()

                                             message  label
0  2 Samuel 4:14:23-14, 17. Dibuat dalam pasal 1 ...      1
1  Pada bidang fisika, "stoner" adalah istilah ya...      1
2  Pendidikan: Di bidang ekonomi, ada proses bela...      1
3  Ada sejumlah penyanyi dalam band ini selama be...      1
4  Menurut hukum Indonesia, terapi pencegahan pen...      1

In [32]:
human_df = human_df.drop(columns=["Unnamed: 0"])

In [33]:
human_df.head()

                                             message  label
0  Toluca Raya atau Wilayah Metropolitan Toluca a...      0
1  Perum Bulog baru saja menerima penugasan dari ...      0
2  Sejumlah pejabat dan karyawan PT Freeport Indo...      0
3  Buntut kasus pegawai Kementerian Keuangan yang...      0
4  Sindangprabu adalah desa di Kecamatan Wanaraja...      0

In [34]:
combined_df = pd.concat([ai_df, human_df], ignore_index=True)

In [ ]:
combined_df = combined_df.sample(frac=1, random_state=42).reset_index(drop=True)

In [36]:
combined_df.head()

                                             message  label
0  Perusahaan manufaktur milik keluarga , PT Buka...      0
1  Federasi Sepak Bola Internasional, FIFA resmi ...      0
2  Silicon Valley Bank (SVB) telah mengibarkan be...      0
3       lebih enak naik pesawat daripada naik sepeda      0
4  Seabria adalah genus kumbang tanduk panjang ya...      0

In [42]:
combined_df[50000:]

                                                  message  label
50000   Jemaah Aboge Probolinggo baru akan berpuasa be...      0
50001   Pendidikan untuk guru, yaitu: "Inikah" - "Kerj...      1
50002   Ilmu yang sering diasosiasikan dengan sains ia...      1
50003   Giovanni Battista Zeno  (atau Zen) (kematian 7...      0
50004   Pada tahun 2003, organisasi bernama Indoworld,...      1
...                                                   ...    ...
209219  Angkong adalah suatu kendaraan bertenaga manus...      0
209220  anak-anak yang mengikuti dari belakang bisa me...      0
209221  Yerida ( yerida, "keturunan") adalah sebuah is...      0
209222  Olenecamptus nigromaculatus adalah spesies kum...      0
209223  Tipula (Eumicrotipula) pediformis adalah spesi...      0

[159224 rows x 2 columns]

In [37]:
combined_df.tail()

                                                  message  label
209219  Angkong adalah suatu kendaraan bertenaga manus...      0
209220  anak-anak yang mengikuti dari belakang bisa me...      0
209221  Yerida ( yerida, "keturunan") adalah sebuah is...      0
209222  Olenecamptus nigromaculatus adalah spesies kum...      0
209223  Tipula (Eumicrotipula) pediformis adalah spesi...      0

In [43]:
combined_df["label"].value_counts()

label
0    109224
1    100000
Name: count, dtype: int64

In [44]:
OUTPUT_PATH = "datasets/combined_ai_human_indonesia.csv"

In [45]:
combined_df.to_csv(OUTPUT_PATH, index=False)